Билет05/Documents/ПриходДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПриходДенег</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСПокупателями</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Билет05/AccumulationRegisters/ВзаиморасчетыСПокупателями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСПокупателями</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Билет05/Documents/ПриходДенег/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ВзаиморасчетыСПокупателями Приход
	Движения.ВзаиморасчетыСПокупателями.Очистить();
	Движения.ВзаиморасчетыСПокупателями.БлокироватьДляИзменения	= Истина;
	Движения.ВзаиморасчетыСПокупателями.Записывать = Истина;
	
	//-------------------- Блокировка ------------------------
	Блокировка			= Новый БлокировкаДанных;
	ЭлБлокировки		= Блокировка.Добавить("РегистрНакопления.ВзаиморасчетыСПокупателями");
	ЭлБлокировки.Режим	= РежимБлокировкиДанных.Исключительный;
	ЭлБлокировки.УстановитьЗначение("Контрагент", Контрагент);
	Блокировка.Заблокировать();
	//--------------------------------------------------------
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыСПокупателямиОстатки.Проект КАК Проект,
		|	ВзаиморасчетыСПокупателямиОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ВзаиморасчетыСПокупателямиОстатки.СуммаВВалютеОстаток КАК СуммаВВалютеОстаток
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
		|			&МоментВремени,
		|			Контрагент = &Контрагент
		|				И Проект <> &ПроектАванс) КАК ВзаиморасчетыСПокупателямиОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВзаиморасчетыСПокупателямиОстатки.Проект.ДатаОплаты";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ПроектАванс", Справочники.Проекты.Авансы);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СуммаРаспределения	= СуммаПлатежа;
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка	= РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Погашение			= Мин(СуммаРаспределения, Выборка.СуммаОстаток); 
			
			Движение = Движения.ВзаиморасчетыСПокупателями.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Контрагент = Контрагент;
			Движение.Проект = Выборка.Проект;
			Движение.Сумма = Погашение;
			Если Погашение = Выборка.СуммаОстаток Тогда
				ПогашениеВал	= Выборка.СуммаВВалютеОстаток;			
			Иначе	
				ПогашениеВал	= Выборка.СуммаВВалютеОстаток * Погашение/Выборка.СуммаОстаток;			
			КонецЕсли; 
			Движение.СуммаВВалюте = ПогашениеВал;
			
			СуммаРаспределения	= СуммаРаспределения - Погашение;		
		КонецЦикла;
	КонецЕсли;
	
	// Аванс
	Если СуммаРаспределения > 0 Тогда
		Движение = Движения.ВзаиморасчетыСПокупателями.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Проект = Справочники.Проекты.Авансы;
		Движение.Сумма = СуммаРаспределения;
	КонецЕсли;

КонецПроцедуры
